tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "coreutils"
# TODO Add completions for fzf
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "htop"
brew "mas"
brew "neovim"
brew "python3"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "yarn"
brew "zsh"
cask "1password"
cask "aerial"
cask "alfred"
cask "amethyst"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "brave-browser-dev"
cask "dash"
cask "dropbox"
# using istat as cask to get all features
cask "istat-menus"
cask "kitty"
cask "mailmate"
cask "sketch"
cask "spotify"
cask "visual-studio-code"
cask "homebrew/cask-drivers/logitech-options"
mas "Amphetamine", id: 937984704
mas "Fantastical", id: 975937182
mas "Numbers", id: 409203825
mas "Things", id: 904280696

