tap "homebrew/cask"
brew "bat"
brew "coreutils"
brew "fzf"
brew "git"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "htop"
brew "httpie"
brew "less" # for git-delta
brew "lsd"
brew "mas" # for installing mac app store apps
brew "neovim"
brew "pyenv" # remember to install python deps (see repo)
brew "ripgrep"
brew "tldr"
brew "tree"
brew "yarn"
brew "zsh"
cask "1password"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "cleanshot"
cask "dash"
cask "docker"
cask "firefox-developer-edition"
cask "google-chrome"
cask "istat-menus" # using istat as cask to get all features
cask "iterm2"
cask "karabiner-elements"
cask "paragon-extfs"
cask "spotify"
mas "1Blocker", id: 1365531024
mas "Day One", id: 1055511498
mas "Divvy", id: 413857545
mas "Fantastical", id: 975937182
mas "Numbers", id: 409203825
mas "Things", id: 904280696
