tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "coreutils"
brew "exa"
brew "fzf"
brew "git"
brew "gh"
brew "gnu-sed"
brew "htop"
brew "mas" # for installing mac app store apps
brew "neovim"
brew "pyenv"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "yarn"
brew "zsh"
cask "1password"
cask "aerial" # screensaver
cask "alfred"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "cardhop"
cask "dash"
cask "divvy"
cask "paragon-extfs"
cask "firefox"
cask "istat-menus" # using istat as cask to get all features
cask "kitty"
cask "logitech-options"
cask "protonmail-bridge"
cask "sketch"
cask "spotify"
mas "1Blocker", id: 1365531024
mas "Fantastical", id: 975937182
mas "Numbers", id: 409203825
mas "Vimari", id: 1480933944
